x893/STM32H747XIH6-CD/Code/STemWin_SampleDemo_DSI_3.5inch/CM7/STemWin/Target/LCDConf_1024x600.c
/* Define the offset of the frame to be used */
#define LCD_FRAME_BUFFER ((U32)0xD0000000)

/* DSI tearing effect GPIO */
#define __DSI_MASK_TE()   (GPIOJ->AFR[0] &= (0xFFFFF0FFU))
#define __DSI_UNMASK_TE() (GPIOJ->AFR[0] |= ((uint32_t)(GPIO_AF13_DSI) << 8))
     
/**
  * @}
  */
/* Redirect bulk conversion to DMA2D routines */
#define DEFINE_DMA2D_COLORCONVERSION(PFIX, PIXELFORMAT)                                                        \
static void _Color2IndexBulk_##PFIX##_DMA2D(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex) { \
  _DMA_Color2IndexBulk(pColor, pIndex, NumItems, SizeOfIndex, PIXELFORMAT);                                    \
}                                                                                                              \
static void _Index2ColorBulk_##PFIX##_DMA2D(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex) { \
  _DMA_Index2ColorBulk(pIndex, pColor, NumItems, SizeOfIndex, PIXELFORMAT);                                    \
}
  
/**
  * @}
  */ 
/** @defgroup LCD CONFIGURATION_Private_Variables
  * @{
  */
LTDC_HandleTypeDef                   hltdc;  
DSI_HandleTypeDef     	             hdsi;
static LCD_LayerPropTypedef          layer_prop[GUI_NUM_LAYERS];
#if defined(USE_800x400)
	/* Screen needed definitions */
	uint8_t pPage[]       = {0x00, 0x00, 0x01, 0xDF}; /*   0 -> 479 */
	/* ZONES of the screen */
	uint8_t pCols[ZONES][4] =
	{
	#if (ZONES == 4 )
		{0x00, 0x00, 0x00, 0xC7}, /*   0 -> 199 */
		{0x00, 0xC8, 0x01, 0x8F}, /* 200 -> 399 */
		{0x01, 0x90, 0x02, 0x57}, /* 400 -> 599 */
		{0x02, 0x58, 0x03, 0x1F}, /* 600 -> 799 */
	#elif (ZONES == 2 )
		{0x00, 0x00, 0x01, 0x8F}, /*   0 -> 399 */
		{0x01, 0x90, 0x03, 0x1F}  
	#elif (ZONES == 1 )
		{0x00, 0x00, 0x01, 0x3F}, /*   0 -> 799 */
	#endif  
	};
#endif
#if defined(USE_1024x600)
	static DSI_VidCfgTypeDef hdsivideo_handle;
	/* Screen needed definitions */
	uint8_t pPage[]       = {0x00, 0x00, 0x02, 0x57}; /*   0 -> 599 */
	/* ZONES of the screen */
	uint8_t pCols[ZONES][4] =
	{
	#if (ZONES == 4 )
		{0x00, 0x00, 0x00, 0xFF}, /*   0 -> 255 */
		{0x01, 0x00, 0x01, 0xFF}, /* 200 -> 511 */
		{0x02, 0x00, 0x05, 0xFF}, /* 512 -> 599 */
		{0x06, 0x00, 0x03, 0xFF}, /* 600 -> 799 */
	#elif (ZONES == 2 )
		{0x00, 0x00, 0x01, 0xFF}, /*   0 -> 511 */
		{0x02, 0x00, 0x03, 0xFF}  
	#elif (ZONES == 1 )
		{0x00, 0x00, 0x03, 0xFF}, /*   0 -> 1023 */
	#endif  
	};
#endif
#if defined(USE_1280x720)
	static DSI_VidCfgTypeDef hdsivideo_handle;
	/* Screen needed definitions */
	uint8_t pPage[]       = {0x00, 0x00, 0x02, 0xCF}; /*   0 -> 719 */
	/* ZONES of the screen */
	uint8_t pCols[ZONES][4] =
	{
	#if (ZONES == 4 )
		{0x00, 0x00, 0x01, 0x3F}, /*   0 -> 319 */
		{0x01, 0x40, 0x02, 0x7F}, /* 320 -> 639 */
		{0x02, 0x80, 0x03, 0xBF}, /* 640 -> 959 */
		{0x03, 0xC0, 0x04, 0xFF}, /* 960 -> 1279*/
	#elif (ZONES == 2 )
		{0x00, 0x00, 0x02, 0x7F}, /*   0 -> 639 */
		{0x02, 0x80, 0x04, 0xFF}	/* 640 -> 1279*/
	#elif (ZONES == 1 )
		{0x00, 0x00, 0x04, 0xFF}, /*   0 -> 1279*/
	#endif  
	};
#endif

volatile int32_t LCD_ActiveRegion    = 1;
volatile int32_t LCD_Refershing      = 0;

/* Array for speeding up nibble conversion for A4 bitmaps */
static const U8 _aMirror[] = {
  0x00, 0x10, 0x20, 0x30, 0x40, 0x50, 0x60, 0x70, 0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,
  0x01, 0x11, 0x21, 0x31, 0x41, 0x51, 0x61, 0x71, 0x81, 0x91, 0xA1, 0xB1, 0xC1, 0xD1, 0xE1, 0xF1,
  0x02, 0x12, 0x22, 0x32, 0x42, 0x52, 0x62, 0x72, 0x82, 0x92, 0xA2, 0xB2, 0xC2, 0xD2, 0xE2, 0xF2,
  0x03, 0x13, 0x23, 0x33, 0x43, 0x53, 0x63, 0x73, 0x83, 0x93, 0xA3, 0xB3, 0xC3, 0xD3, 0xE3, 0xF3,
  0x04, 0x14, 0x24, 0x34, 0x44, 0x54, 0x64, 0x74, 0x84, 0x94, 0xA4, 0xB4, 0xC4, 0xD4, 0xE4, 0xF4,
  0x05, 0x15, 0x25, 0x35, 0x45, 0x55, 0x65, 0x75, 0x85, 0x95, 0xA5, 0xB5, 0xC5, 0xD5, 0xE5, 0xF5,
  0x06, 0x16, 0x26, 0x36, 0x46, 0x56, 0x66, 0x76, 0x86, 0x96, 0xA6, 0xB6, 0xC6, 0xD6, 0xE6, 0xF6,
  0x07, 0x17, 0x27, 0x37, 0x47, 0x57, 0x67, 0x77, 0x87, 0x97, 0xA7, 0xB7, 0xC7, 0xD7, 0xE7, 0xF7,
  0x08, 0x18, 0x28, 0x38, 0x48, 0x58, 0x68, 0x78, 0x88, 0x98, 0xA8, 0xB8, 0xC8, 0xD8, 0xE8, 0xF8,
  0x09, 0x19, 0x29, 0x39, 0x49, 0x59, 0x69, 0x79, 0x89, 0x99, 0xA9, 0xB9, 0xC9, 0xD9, 0xE9, 0xF9,
  0x0A, 0x1A, 0x2A, 0x3A, 0x4A, 0x5A, 0x6A, 0x7A, 0x8A, 0x9A, 0xAA, 0xBA, 0xCA, 0xDA, 0xEA, 0xFA,
  0x0B, 0x1B, 0x2B, 0x3B, 0x4B, 0x5B, 0x6B, 0x7B, 0x8B, 0x9B, 0xAB, 0xBB, 0xCB, 0xDB, 0xEB, 0xFB,
  0x0C, 0x1C, 0x2C, 0x3C, 0x4C, 0x5C, 0x6C, 0x7C, 0x8C, 0x9C, 0xAC, 0xBC, 0xCC, 0xDC, 0xEC, 0xFC,
  0x0D, 0x1D, 0x2D, 0x3D, 0x4D, 0x5D, 0x6D, 0x7D, 0x8D, 0x9D, 0xAD, 0xBD, 0xCD, 0xDD, 0xED, 0xFD,
  0x0E, 0x1E, 0x2E, 0x3E, 0x4E, 0x5E, 0x6E, 0x7E, 0x8E, 0x9E, 0xAE, 0xBE, 0xCE, 0xDE, 0xEE, 0xFE,
  0x0F, 0x1F, 0x2F, 0x3F, 0x4F, 0x5F, 0x6F, 0x7F, 0x8F, 0x9F, 0xAF, 0xBF, 0xCF, 0xDF, 0xEF, 0xFF,
};

/* Frame buffer tables to be used */
static const U32      _aAddr[]   = { LCD_FRAME_BUFFER, LCD_FRAME_BUFFER + XSIZE_PHYS * YSIZE_PHYS * sizeof(U32) * NUM_VSCREENS * NUM_BUFFERS };
U32                   LCD_Addr[] = { LCD_FRAME_BUFFER, LCD_FRAME_BUFFER + XSIZE_PHYS * YSIZE_PHYS * sizeof(U32) * NUM_VSCREENS * NUM_BUFFERS };

static int _aPendingBuffer[2] = { -1, -1 };
static int _aBufferIndex[GUI_NUM_LAYERS];
static int _axSize[GUI_NUM_LAYERS];
static int _aySize[GUI_NUM_LAYERS];
static int _aBytesPerPixels[GUI_NUM_LAYERS];
static U32 _aBuffer[XSIZE_PHYS * sizeof(U32) * 3];
static U32 * _pBuffer_DMA2D = &_aBuffer[XSIZE_PHYS * sizeof(U32) * 0];

/* Array of color conversions for each layer */
static const LCD_API_COLOR_CONV * _apColorConvAPI[] = 
{
  COLOR_CONVERSION_0,
#if GUI_NUM_LAYERS > 1
  COLOR_CONVERSION_1,
#endif
};

/* Array of orientations for each layer */
static const int _aOrientation[] = 
{
  ORIENTATION_0,
#if GUI_NUM_LAYERS > 1
  ORIENTATION_1,
#endif
};

/**
  * @}
  */ 

/** @defgroup LCD CONFIGURATION_Private_FunctionPrototypes
  * @{
  */ 
static void _DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat);
static void _DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat);

/* Color conversion routines using DMA2D */
DEFINE_DMA2D_COLORCONVERSION(M8888I, LTDC_PIXEL_FORMAT_ARGB8888)
/* Internal pixel format of emWin is 32 bit, because of that ARGB8888 */
DEFINE_DMA2D_COLORCONVERSION(M888,   LTDC_PIXEL_FORMAT_ARGB8888) 
DEFINE_DMA2D_COLORCONVERSION(M565,   LTDC_PIXEL_FORMAT_RGB565)
DEFINE_DMA2D_COLORCONVERSION(M1555I, LTDC_PIXEL_FORMAT_ARGB1555)
DEFINE_DMA2D_COLORCONVERSION(M4444I, LTDC_PIXEL_FORMAT_ARGB4444)

void LCD_SetUpdateRegion(int idx);
void LCD_ReqTear(void);
void DSI_IRQHandler(void);

